In [1]:
import pandas as pd

In [ ]:
Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
data=[ 4, 8, 15, 16, 23,42]
dic={"data":data}
df=pd.DataFrame(dic)
df

   data
0     4
1     8
2    15
3    16
4    23
5    42

In [ ]:
Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [3]:
name=["ravi","shiv","ansh"]
my_series=pd.Series(name)

In [4]:
my_series

0    ravi
1    shiv
2    ansh
dtype: object

In [ ]:
Q3.

In [5]:
Name=['Alice','Bob','Claire']
Age=[25,30,27]
Gender=['Female','Male','Female']
dic={'Name':Name,'Age':Age,'Gender':Gender}
df2=pd.DataFrame(dic)

In [6]:
df2

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [ ]:
-->In pandas, a DataFrame is a two-dimensional tabular data structure that represents data in rows and columns, similar to a spreadsheet or a SQL table.
-->On the other hand, a Series is a one-dimensional labeled array that can hold data of any type, similar to a list or a one-column table in a spreadsheet.
example

In [7]:
# Example data for a DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 22, 28],
    'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}

# Create a DataFrame
df = pd.DataFrame(data)

# Series
name_series = df['Name']
print("\nSeries - Name:")
print(name_series)

# Accessing the  DataFrame
print("DataFrame:")
print(df)

Series - Name:
0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object
DataFrame:
      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   22    Los Angeles
3    David   28        Chicago

In [ ]:
Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [ ]:
some common functions you can use:
head(),tail(),info(),describe(),sort_values(),filter(),groupby()
examples

In [8]:
df.head()

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   22    Los Angeles
3    David   28        Chicago

In [9]:
df.tail()

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   22    Los Angeles
3    David   28        Chicago

In [10]:
df.info

<bound method DataFrame.info of       Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   22    Los Angeles
3    David   28        Chicago>

In [11]:
df.describe

<bound method NDFrame.describe of       Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   22    Los Angeles
3    David   28        Chicago>

In [12]:
df.sort_values(by='Age')

      Name  Age           City
2  Charlie   22    Los Angeles
0    Alice   25       New York
3    David   28        Chicago
1      Bob   30  San Francisco

In [13]:
grouped_df = df.groupby('City')['Age'].mean()
print(grouped_df)

City
Chicago          28.0
Los Angeles      22.0
New York         25.0
San Francisco    30.0
Name: Age, dtype: float64

In [ ]:
Q6.Which of the following is mutable in nature Series, DataFrame, Panel?

In [ ]:
Among the three pandas data structures, Series, DataFrame, and Panel, the DataFrame is mutable in nature.

Series: A pandas Series is a one-dimensional labeled array, and it is immutable. Once a Series is created, you cannot modify its size or change its values. You can, however, modify individual elements by accessing them using their index.

DataFrame: A pandas DataFrame is a two-dimensional tabular data structure, and it is mutable. You can add or remove columns, modify existing columns, and change the values in the DataFrame after it is created.

Panel: A pandas Panel is a three-dimensional data structure, and it is also mutable. However, it is not as commonly used as Series and DataFrame, and starting from pandas version 0.25.0, the Panel class is deprecated in favor of using MultiIndex DataFrames.

In [ ]:
Q7. Create a DataFrame using multiple Series. Explain with an example.

In [14]:
import pandas as pd

# multiple Series
name_series = pd.Series(['Alice', 'Bob', 'Charlie', 'David'])
age_series = pd.Series([25, 30, 22, 28])
city_series = pd.Series(['New York', 'San Francisco', 'Los Angeles', 'Chicago'])

# create a DataFrame
df = pd.DataFrame({
    'Name': name_series,
    'Age': age_series,
    'City': city_series
})


print(df)

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   22    Los Angeles
3    David   28        Chicago